# ЗАДАНИЕ 4
#
# Склонение слова
# Реализовать склонение слова «процент» во фразе «N процентов». Вывести эту фразу на экран
# отдельной строкой для каждого из чисел в интервале от 1 до 100:
# 1 процент
# 2 процента
# 3 процента
# 4 процента
# 5 процентов
# 6 процентов
# ...
# 100 процентов

n = 1
for i in range(0, 100):
    if n == 11 or n == 12 or n == 13 or n == 14:
        print(n, 'процентов')
        n = n + 1
    elif n == 1 or n % 10 == 1:
        print(n, 'процент')
        n = n + 1
    elif n == 2 or n % 10 == 2 or n == 3 or n % 10 == 3 or n == 4 or n % 10 == 4:
        print(n, 'процента')
        n = n + 1
    elif n == 11 or n == 12 or n == 13 or n == 14:
        print(n, 'процентов')
        n = n + 1
    else:
        print(n, 'процентов')
        n = n + 1
